{
    "token_to_index": {
        "<PAD>": 0,
        "<UNK>": 1,
        "<SOS>": 2,
        "<EOS>": 3,
        "(": 4,
        ")": 5,
        "+": 6,
        "-": 7,
        "/": 8,
        "0": 9,
        "1": 10,
        "2": 11,
        "3": 12,
        "4": 13,
        "5": 14,
        "6": 15,
        "7": 16,
        "8": 17,
        "9": 18,
        "<": 19,
        "=": 20,
        ">": 21,
        "[": 22,
        "\\alpha": 23,
        "\\beta": 24,
        "\\big": 25,
        "\\bigg": 26,
        "\\cdot": 27,
        "\\cdots": 28,
        "\\cos": 29,
        "\\delta": 30,
        "\\div": 31,
        "\\dots": 32,
        "\\exists": 33,
        "\\forall": 34,
        "\\frac": 35,
        "\\gamma": 36,
        "\\geq": 37,
        "\\gt": 38,
        "\\gtm": 39,
        "\\gtp": 40,
        "\\hbox": 41,
        "\\in": 42,
        "\\infty": 43,
        "\\int": 44,
        "\\lambda": 45,
        "\\lbrack": 46,
        "\\ldots": 47,
        "\\left": 48,
        "\\leq": 49,
        "\\lim": 50,
        "\\limits": 51,
        "\\log": 52,
        "\\lt": 53,
        "\\ltl": 54,
        "\\ltn": 55,
        "\\ltq": 56,
        "\\mathrm": 57,
        "\\mbox": 58,
        "\\mu": 59,
        "\\neq": 60,
        "\\parallel": 61,
        "\\phi": 62,
        "\\pi": 63,
        "\\pm": 64,
        "\\prime": 65,
        "\\rbrack": 66,
        "\\right": 67,
        "\\rightarrow": 68,
        "\\sigma": 69,
        "\\sin": 70,
        "\\sqrt": 71,
        "\\sum": 72,
        "\\tan": 73,
        "\\theta": 74,
        "\\times": 75,
        "\\to": 76,
        "\\vtop": 77,
        "]": 78,
        "^": 79,
        "_": 80,
        "a": 81,
        "b": 82,
        "c": 83,
        "d": 84,
        "e": 85,
        "f": 86,
        "g": 87,
        "h": 88,
        "i": 89,
        "j": 90,
        "k": 91,
        "l": 92,
        "m": 93,
        "n": 94,
        "o": 95,
        "p": 96,
        "q": 97,
        "r": 98,
        "s": 99,
        "t": 100,
        "u": 101,
        "v": 102,
        "w": 103,
        "x": 104,
        "y": 105,
        "z": 106,
        "{": 107,
        "}": 108
    },
    "index_to_token": {
        "0": "<PAD>",
        "1": "<UNK>",
        "2": "<SOS>",
        "3": "<EOS>",
        "4": "(",
        "5": ")",
        "6": "+",
        "7": "-",
        "8": "/",
        "9": "0",
        "10": "1",
        "11": "2",
        "12": "3",
        "13": "4",
        "14": "5",
        "15": "6",
        "16": "7",
        "17": "8",
        "18": "9",
        "19": "<",
        "20": "=",
        "21": ">",
        "22": "[",
        "23": "\\alpha",
        "24": "\\beta",
        "25": "\\big",
        "26": "\\bigg",
        "27": "\\cdot",
        "28": "\\cdots",
        "29": "\\cos",
        "30": "\\delta",
        "31": "\\div",
        "32": "\\dots",
        "33": "\\exists",
        "34": "\\forall",
        "35": "\\frac",
        "36": "\\gamma",
        "37": "\\geq",
        "38": "\\gt",
        "39": "\\gtm",
        "40": "\\gtp",
        "41": "\\hbox",
        "42": "\\in",
        "43": "\\infty",
        "44": "\\int",
        "45": "\\lambda",
        "46": "\\lbrack",
        "47": "\\ldots",
        "48": "\\left",
        "49": "\\leq",
        "50": "\\lim",
        "51": "\\limits",
        "52": "\\log",
        "53": "\\lt",
        "54": "\\ltl",
        "55": "\\ltn",
        "56": "\\ltq",
        "57": "\\mathrm",
        "58": "\\mbox",
        "59": "\\mu",
        "60": "\\neq",
        "61": "\\parallel",
        "62": "\\phi",
        "63": "\\pi",
        "64": "\\pm",
        "65": "\\prime",
        "66": "\\rbrack",
        "67": "\\right",
        "68": "\\rightarrow",
        "69": "\\sigma",
        "70": "\\sin",
        "71": "\\sqrt",
        "72": "\\sum",
        "73": "\\tan",
        "74": "\\theta",
        "75": "\\times",
        "76": "\\to",
        "77": "\\vtop",
        "78": "]",
        "79": "^",
        "80": "_",
        "81": "a",
        "82": "b",
        "83": "c",
        "84": "d",
        "85": "e",
        "86": "f",
        "87": "g",
        "88": "h",
        "89": "i",
        "90": "j",
        "91": "k",
        "92": "l",
        "93": "m",
        "94": "n",
        "95": "o",
        "96": "p",
        "97": "q",
        "98": "r",
        "99": "s",
        "100": "t",
        "101": "u",
        "102": "v",
        "103": "w",
        "104": "x",
        "105": "y",
        "106": "z",
        "107": "{",
        "108": "}"
    }
}